<a href="https://colab.research.google.com/github/shcho11/Python_Basics_memo3/blob/main/pandas_practice_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = [[9.9, 8.8], [np.nan, 6.6],[7.7, np.nan],  [0.99, 9.8]]
df = pd.DataFrame(data, columns=["first", "second"], index=["a", "b", "c", "d"])

In [ ]:
df

   first  second
a   9.90     8.8
b    NaN     6.6
c   7.70     NaN
d   0.99     9.8

In [ ]:
df.sum(axis=0)

first     18.59
second    25.20
dtype: float64

In [ ]:
df['first'].mean()

6.196666666666666

In [ ]:
df.loc['a'].sum()

18.700000000000003

In [ ]:
df

   first  second
a   9.90     8.8
b    NaN     6.6
c   7.70     NaN
d   0.99     9.8

In [ ]:
first_mean = df['first'].mean()
first_mean

6.196666666666666

In [ ]:
second_min = df['second'].min()
second_min

6.6

In [ ]:
df['first'] = df['first'].fillna(value=first_mean)
df['second'] = df['second'].fillna(value=second_min)

In [ ]:
df

      first  second
a  9.900000     8.8
b  6.196667     6.6
c  7.700000     6.6
d  0.990000     9.8

In [ ]:
df2= pd.DataFrame(np.random.randn(6,4),
                  columns=['A','B','C','D'],
                  index=pd.date_range('20220501', periods=6))
df2

                   A         B         C         D
2022-05-01  0.237088  0.212618 -0.794336 -0.573887
2022-05-02 -0.296808 -0.744179  1.463552 -0.742103
2022-05-03 -0.783162  0.018967 -0.716888  0.511524
2022-05-04 -1.342591  1.666754 -0.864254  1.326088
2022-05-05  1.686396  1.218381  0.553293 -0.327656
2022-05-06 -0.801593  0.829621 -0.438421 -0.217137

In [ ]:
df2['A'].corr(df2['B'])

0.02177759955076149

In [ ]:
df2.corr()

          A         B         C         D
A  1.000000  0.021778  0.437660 -0.591070
B  0.021778  1.000000 -0.479304  0.608165
C  0.437660 -0.479304  1.000000 -0.607062
D -0.591070  0.608165 -0.607062  1.000000

In [ ]:
df2['E'] = np.random.randint(0,6,size=6)
df2['F'] = ['first','second','first','third','second','first']
df2

                   A         B         C         D  E       F
2022-05-01  0.237088  0.212618 -0.794336 -0.573887  3   first
2022-05-02 -0.296808 -0.744179  1.463552 -0.742103  2  second
2022-05-03 -0.783162  0.018967 -0.716888  0.511524  3   first
2022-05-04 -1.342591  1.666754 -0.864254  1.326088  2   third
2022-05-05  1.686396  1.218381  0.553293 -0.327656  5  second
2022-05-06 -0.801593  0.829621 -0.438421 -0.217137  2   first

In [ ]:
df2.sort_values(by=['E','F'])

                   A         B         C         D  E       F
2022-05-06 -0.801593  0.829621 -0.438421 -0.217137  2   first
2022-05-02 -0.296808 -0.744179  1.463552 -0.742103  2  second
2022-05-04 -1.342591  1.666754 -0.864254  1.326088  2   third
2022-05-01  0.237088  0.212618 -0.794336 -0.573887  3   first
2022-05-03 -0.783162  0.018967 -0.716888  0.511524  3   first
2022-05-05  1.686396  1.218381  0.553293 -0.327656  5  second

In [ ]:
df3 = pd.DataFrame(np.random.randn(4, 3), columns=["b", "d", "e"],
                   index=["Seoul", "Incheon", "Busan", "Daegu"])

In [ ]:
df3

                b         d         e
Seoul   -0.417295  1.101535 -1.045476
Incheon -2.463839 -0.237181 -0.262947
Busan    1.072089 -0.512656  0.673375
Daegu    1.983395 -1.056348 -1.460389

In [ ]:
func = lambda x : x.max() - x.min()

In [ ]:
df3.apply(func,axis=0)

b    4.447234
d    2.157884
e    2.133764
dtype: float64

In [ ]:
df3.apply(func,axis=1)

Seoul      2.147012
Incheon    2.226658
Busan      1.584745
Daegu      3.443784
dtype: float64

In [ ]:
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
sr.cumsum()

0     1
1     3
2     6
3    10
4    15
dtype: int64

In [ ]:
sr.cumprod()

0      1
1      2
2      6
3     24
4    120
dtype: int64